exports.type = {
  友好切磋: 0.002,
  認真對決: 0.05,
  決一死戰: 0.25,
  我要殺死你: 0.6,
};

exports.magic_skill = {
  天野陽菜: 0.05,
  兔田ぺこら: 0.6,
  努西: 0.15,
  記憶解放: 0.1,
  噴火龍: 0.25,
  白上フブキ: 0.8,
  潤羽るしあ: 0.6,
  夏色まつり: 0.25,
  桐生ココ: 0.75,
  直葉: 0.2,
};

exports.sword_skill = {
  旋風: 1,
  魔人的一擊: 1,
  隕石衝擊: 1,
  雪崩: 1,
  星爆氣流斬: 1,
  爆裂拳: 1,
  超越系統的一擊: 1,
  聖母聖詠: 1,
  黑卡蒂: 1,
};

exports.defense_skill = {
  立體機動裝置: 0.125,
  雜燴兔: 0.125,
  宝鐘マリン: 0.08,
  大總統: 0.125,
  白銀ノエル: 0.08,
  希茲克利夫: 0.125,
  極限輔助系統: 0.75,
};

exports.MAX_SKILL = 6;
